ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/AM263X/TOP_CTRL_TOP_CTRL_50D80000h.xml
		<bitfield id="TSENSE_STATUS_RAW_S1_COLD" width="1" begin="6" end="6" resetval="0x0" description="temperature Sensor 1 hot event detect0 : event not occured1 : event occurred**Note: This bit will only be reset by PORz." range="6" rwaccess="R"/>
	<bitfield id="TSENSE_STATUS_RAW_S1_HOT" width="1" begin="5" end="5" resetval="0x0" description="temperature Sensor 1 cold event detect0 : event not occured1 : event occurred**Note: This bit will only be reset by PORz." range="5" rwaccess="R"/>
	<bitfield id="TSENSE_STATUS_RAW_S1_LOW_THRHLD" width="1" begin="4" end="4" resetval="0x0" description="temperature Sensor 1 low threshold event detect0 : event not occured1 : event occurred**Note: This bit will only be reset by PORz." range="4" rwaccess="R"/>
	<bitfield id="TSENSE_STATUS_RAW_S0_COLD" width="1" begin="2" end="2" resetval="0x0" description="temperature Sensor 0 hot event detect0 : event not occured1 : event occurred**Note: This bit will only be reset by PORz." range="2" rwaccess="R"/>
	<bitfield id="TSENSE_STATUS_RAW_S0_HOT" width="1" begin="1" end="1" resetval="0x0" description="temperature Sensor 0 cold event detect0 : event not occured1 : event occurred**Note: This bit will only be reset by PORz." range="1" rwaccess="R"/>
	<bitfield id="TSENSE_STATUS_RAW_S0_LOW_THRHLD" width="1" begin="0" end="0" resetval="0x0" description="temperature Sensor 0 low threshold event detect0 : event not occured1 : event occurred**Note: This bit will only be reset by PORz." range="0" rwaccess="R"/>
	</register><register id="TOP_CTRL_TSENSE0_ALERT" acronym="TOP_CTRL_TSENSE0_ALERT" offset="3348" width="32" description="This register is used to configure the temperature thresholds for Temp Sensor 0 for generating Alert Interrupts.">
		<bitfield id="TSENSE0_ALERT_ALERT_THRHLD_HOT" width="8" begin="23" end="16" resetval="0x0" description="cold threshold/low temp threshold**Note: This bit will only be reset by PORz." range="23:16" rwaccess="R/W"/>
	<bitfield id="TSENSE0_ALERT_ALERT_THRHLD_COLD" width="8" begin="7" end="0" resetval="0x0" description="Hot threshold/high temp threshold**Note: This bit will only be reset by PORz." range="7:0" rwaccess="R/W"/>
	</register><register id="TOP_CTRL_TSENSE0_CNTL" acronym="TOP_CTRL_TSENSE0_CNTL" offset="3352" width="32" description="This register is used to control and configure Temperature sensor 0">
		<bitfield id="TSENSE0_CNTL_MASK_LOW_THRHLD" width="1" begin="24" end="24" resetval="0x0" description="mask low threshold comparator output**Note: This bit will only be reset by PORz." range="24" rwaccess="R/W"/>
	<bitfield id="TSENSE0_CNTL_MASK_COLD" width="1" begin="20" end="20" resetval="0x1" description="Mask hot comparator output**Note: This bit will only be reset by PORz." range="20" rwaccess="R/W"/>
	<bitfield id="TSENSE0_CNTL_MASK_HOT" width="1" begin="16" end="16" resetval="0x0" description="mask cold comparator output**Note: This bit will only be reset by PORz." range="16" rwaccess="R/W"/>
	<bitfield id="TSENSE0_CNTL_ACCU_CLEAR" width="1" begin="8" end="8" resetval="0x0" description="Accumulator clear**Note: This bit will only be reset by PORz." range="8" rwaccess="R/W"/>
	<bitfield id="TSENSE0_CNTL_FIFO_FREEZE" width="1" begin="4" end="4" resetval="0x0" description="fifo freeze**Note: This bit will only be reset by PORz." range="4" rwaccess="R/W"/>
	<bitfield id="TSENSE0_CNTL_FIFO_CLEAR" width="1" begin="0" end="0" resetval="0x0" description="fifo clear**Note: This bit will only be reset by PORz." range="0" rwaccess="R/W"/>
	</register><register id="TOP_CTRL_TSENSE0_RESULT" acronym="TOP_CTRL_TSENSE0_RESULT" offset="3356" width="32" description="This register shows the most recent temperature readout and  status of any ongoing Temperature measurement from Temperature Sensor 0">
		<bitfield id="TSENSE0_RESULT_ECOZ" width="1" begin="16" end="16" resetval="0x0" description="Conversion in Progress.1 : Conversion on going0 : conversion completed**Note: This bit will only be reset by PORz." range="16" rwaccess="R"/>
	<bitfield id="TSENSE0_RESULT_DTEMP" width="8" begin="7" end="0" resetval="0x0" description="Temp Code readout**Note: This bit will only be reset by PORz." range="7:0" rwaccess="R"/>
	</register><register id="TOP_CTRL_TSENSE0_DATA0" acronym="TOP_CTRL_TSENSE0_DATA0" offset="3360" width="32" description="This register shows Temp Sensor 0 result data in FIFO Register 0">
		<bitfield id="TSENSE0_DATA0_TAG" width="24" begin="31" end="8" resetval="0x0" description="Timestamp for temperature sesnor 0 Data 0 measured**Note: This bit will only be reset by PORz." range="31:8" rwaccess="R"/>
	<bitfield id="TSENSE0_DATA0_DATA" width="8" begin="7" end="0" resetval="0x0" description="Temperature Sensor0 FIFO data 0**Note: This bit will only be reset by PORz." range="7:0" rwaccess="R"/>
	</register><register id="TOP_CTRL_TSENSE0_DATA1" acronym="TOP_CTRL_TSENSE0_DATA1" offset="3364" width="32" description="This register shows Temp Sensor 0 result data in FIFO Register 1">
		<bitfield id="TSENSE0_DATA1_TAG" width="24" begin="31" end="8" resetval="0x0" description="Timestamp for temperature sesnor 0 Data 1 measured**Note: This bit will only be reset by PORz." range="31:8" rwaccess="R"/>
	<bitfield id="TSENSE0_DATA1_DATA" width="8" begin="7" end="0" resetval="0x0" description="Temperature Sensor0 FIFO data 1**Note: This bit will only be reset by PORz." range="7:0" rwaccess="R"/>
	</register><register id="TOP_CTRL_TSENSE0_DATA2" acronym="TOP_CTRL_TSENSE0_DATA2" offset="3368" width="32" description="This register shows Temp Sensor 0 result data in FIFO Register 2">
		<bitfield id="TSENSE0_DATA2_TAG" width="24" begin="31" end="8" resetval="0x0" description="Timestamp for temperature sesnor 0 Data 2 measured**Note: This bit will only be reset by PORz." range="31:8" rwaccess="R"/>
	<bitfield id="TSENSE0_DATA2_DATA" width="8" begin="7" end="0" resetval="0x0" description="Temperature Sensor0 FIFO data 2**Note: This bit will only be reset by PORz." range="7:0" rwaccess="R"/>
	</register><register id="TOP_CTRL_TSENSE0_DATA3" acronym="TOP_CTRL_TSENSE0_DATA3" offset="3372" width="32" description="This register shows Temp Sensor 0 result data in FIFO Register 3">
		<bitfield id="TSENSE0_DATA3_TAG" width="24" begin="31" end="8" resetval="0x0" description="Timestamp for temperature sesnor 0 Data 3 measured**Note: This bit will only be reset by PORz." range="31:8" rwaccess="R"/>
	<bitfield id="TSENSE0_DATA3_DATA" width="8" begin="7" end="0" resetval="0x0" description="Temperature Sensor0 FIFO data 3**Note: This bit will only be reset by PORz." range="7:0" rwaccess="R"/>
	</register><register id="TOP_CTRL_TSENSE0_ACCU" acronym="TOP_CTRL_TSENSE0_ACCU" offset="3376" width="32" description="Temp Sensor 0 Result Accumulator Register.">
		<bitfield id="TSENSE0_ACCU_CUMUL" width="32" begin="31" end="0" resetval="0x0" description="cumulative sum of past DTEMPs**Note: This bit will only be reset by PORz." range="31:0" rwaccess="R"/>
	</register><register id="TOP_CTRL_TSENSE1_TSHUT" acronym="TOP_CTRL_TSENSE1_TSHUT" offset="3392" width="32" description="This register is used to override the factory specified Tshut temperature with an application specific Tshut temperature for Temperature sensor 1">
		<bitfield id="TSENSE1_TSHUT_EFUSE_OVERRIDE" width="3" begin="31" end="29" resetval="0x0" description="Efuse override000 -- Value from EFUSE is used as tshut hot and tshut cold thresholds111 - Overide value takes effect**Note: This bit will only be reset by PORz." range="31:29" rwaccess="R/W"/>
	<bitfield id="TSENSE1_TSHUT_TSHUT_THRHLD_HOT" width="8" begin="23" end="16" resetval="0x0" description="tshut hot threshold. Reads efuse value untill overwritten with override = 111**Note: This bit will only be reset by PORz." range="23:16" rwaccess="R/W"/>
	<bitfield id="TSENSE1_TSHUT_TSHUT_THRSHLD_COLD" width="8" begin="7" end="0" resetval="0x0" description="tshut cold threshold. Reads efuse value untill overwritten with override = 111**Note: This bit will only be reset by PORz." range="7:0" rwaccess="R/W"/>
	</register><register id="TOP_CTRL_TSENSE1_ALERT" acronym="TOP_CTRL_TSENSE1_ALERT" offset="3396" width="32" description="This register is used to configure the temperature thresholds for Temp Sensor 1 for generating Alert Interrupts.">
		<bitfield id="TSENSE1_ALERT_ALERT_THRHLD_HOT" width="8" begin="23" end="16" resetval="0x0" description="cold threshold/low temp threshold**Note: This bit will only be reset by PORz." range="23:16" rwaccess="R/W"/>
	<bitfield id="TSENSE1_ALERT_ALERT_THRHLD_COLD" width="8" begin="7" end="0" resetval="0x0" description="Hot threshold/high temp threshold**Note: This bit will only be reset by PORz." range="7:0" rwaccess="R/W"/>
	</register><register id="TOP_CTRL_TSENSE1_CNTL" acronym="TOP_CTRL_TSENSE1_CNTL" offset="3400" width="32" description="This register is used to control and configure Temperature sensor 1">
		<bitfield id="TSENSE1_CNTL_MASK_LOW_THRHLD" width="1" begin="24" end="24" resetval="0x0" description="mask low threshold comparator output**Note: This bit will only be reset by PORz." range="24" rwaccess="R/W"/>
	<bitfield id="TSENSE1_CNTL_MASK_COLD" width="1" begin="20" end="20" resetval="0x1" description="Mask hot comparator output**Note: This bit will only be reset by PORz." range="20" rwaccess="R/W"/>
	<bitfield id="TSENSE1_CNTL_MASK_HOT" width="1" begin="16" end="16" resetval="0x0" description="mask cold comparator output**Note: This bit will only be reset by PORz." range="16" rwaccess="R/W"/>
	<bitfield id="TSENSE1_CNTL_ACCU_CLEAR" width="1" begin="8" end="8" resetval="0x0" description="Accumulator clear**Note: This bit will only be reset by PORz." range="8" rwaccess="R/W"/>
	<bitfield id="TSENSE1_CNTL_FIFO_FREEZE" width="1" begin="4" end="4" resetval="0x0" description="fifo freeze**Note: This bit will only be reset by PORz." range="4" rwaccess="R/W"/>
	<bitfield id="TSENSE1_CNTL_FIFO_CLEAR" width="1" begin="0" end="0" resetval="0x0" description="fifo clear**Note: This bit will only be reset by PORz." range="0" rwaccess="R/W"/>
	</register><register id="TOP_CTRL_TSENSE1_RESULT" acronym="TOP_CTRL_TSENSE1_RESULT" offset="3404" width="32" description="This register shows the most recent temperature readout and status of any ongoing Temperature measurement from Temperature Sensor 1">
		<bitfield id="TSENSE1_RESULT_ECOZ" width="1" begin="16" end="16" resetval="0x0" description="Conversion in Progress.1 : Conversion on going0 : conversion completed**Note: This bit will only be reset by PORz." range="16" rwaccess="R"/>
	<bitfield id="TSENSE1_RESULT_DTEMP" width="8" begin="7" end="0" resetval="0x0" description="Temp Code readout**Note: This bit will only be reset by PORz." range="7:0" rwaccess="R"/>
	</register><register id="TOP_CTRL_TSENSE1_DATA0" acronym="TOP_CTRL_TSENSE1_DATA0" offset="3408" width="32" description="This register shows Temp Sensor 1 result data in FIFO Register 0">
		<bitfield id="TSENSE1_DATA0_TAG" width="24" begin="31" end="8" resetval="0x0" description="Timestamp for temperature sesnor 1 Data 0 measured**Note: This bit will only be reset by PORz." range="31:8" rwaccess="R"/>
	<bitfield id="TSENSE1_DATA0_DATA" width="8" begin="7" end="0" resetval="0x0" description="Temperature sensor 1 FIFO Data 0**Note: This bit will only be reset by PORz." range="7:0" rwaccess="R"/>
	</register><register id="TOP_CTRL_TSENSE1_DATA1" acronym="TOP_CTRL_TSENSE1_DATA1" offset="3412" width="32" description="This register shows Temp Sensor 1 result data in FIFO Register 1">
		<bitfield id="TSENSE1_DATA1_TAG" width="24" begin="31" end="8" resetval="0x0" description="Timestamp for temperature sesnor 1 Data 1 measured**Note: This bit will only be reset by PORz." range="31:8" rwaccess="R"/>
	<bitfield id="TSENSE1_DATA1_DATA" width="8" begin="7" end="0" resetval="0x0" description="Temperature sensor 1 FIFO Data 1**Note: This bit will only be reset by PORz." range="7:0" rwaccess="R"/>
	</register><register id="TOP_CTRL_TSENSE1_DATA2" acronym="TOP_CTRL_TSENSE1_DATA2" offset="3416" width="32" description="This register shows Temp Sensor 1 result data in FIFO Register 2">
		<bitfield id="TSENSE1_DATA2_TAG" width="24" begin="31" end="8" resetval="0x0" description="Timestamp for temperature sesnor 1 Data 2 measured**Note: This bit will only be reset by PORz." range="31:8" rwaccess="R"/>
	<bitfield id="TSENSE1_DATA2_DATA" width="8" begin="7" end="0" resetval="0x0" description="Temperature sensor 1 FIFO Data 2**Note: This bit will only be reset by PORz." range="7:0" rwaccess="R"/>
	</register><register id="TOP_CTRL_TSENSE1_DATA3" acronym="TOP_CTRL_TSENSE1_DATA3" offset="3420" width="32" description="This register shows Temp Sensor 1 result data in FIFO Register 3">
		<bitfield id="TSENSE1_DATA3_TAG" width="24" begin="31" end="8" resetval="0x0" description="Timestamp for temperature sesnor 1 Data 3 measured**Note: This bit will only be reset by PORz." range="31:8" rwaccess="R"/>
	<bitfield id="TSENSE1_DATA3_DATA" width="8" begin="7" end="0" resetval="0x0" description="Temperature sensor 1 FIFO Data 3**Note: This bit will only be reset by PORz." range="7:0" rwaccess="R"/>
	</register><register id="TOP_CTRL_TSENSE1_ACCU" acronym="TOP_CTRL_TSENSE1_ACCU" offset="3424" width="32" description="Temp Sensor 1 Result Accumulator Register.">
		<bitfield id="TSENSE1_ACCU_CUMUL" width="32" begin="31" end="0" resetval="0x0" description="cumulative sum of past DTEMPs**Note: This bit will only be reset by PORz." range="31:0" rwaccess="R"/>
	</register><register id="TOP_CTRL_TSENSE2_RESULT" acronym="TOP_CTRL_TSENSE2_RESULT" offset="3452" width="32" description="This register shows the most recent temperature readout and status of any ongoing Temperature measurement from Temperature Sensor 2">
		<bitfield id="TSENSE2_RESULT_ECOZ" width="1" begin="16" end="16" resetval="0x0" description="Conversion in Progress.1 : Conversion on going0 : conversion completed**Note: This bit will only be reset by PORz." range="16" rwaccess="R"/>
	<bitfield id="TSENSE2_RESULT_DTEMP" width="8" begin="7" end="0" resetval="0x0" description="Temp Code readout**Note: This bit will only be reset by PORz." range="7:0" rwaccess="R"/>
	</register><register id="TOP_CTRL_TSENSE3_RESULT" acronym="TOP_CTRL_TSENSE3_RESULT" offset="3500" width="32" description="This register shows the most recent temperature readout and status of any ongoing Temperature measurement from Temperature Sensor 3">
		<bitfield id="TSENSE3_RESULT_ECOZ" width="1" begin="16" end="16" resetval="0x0" description="Conversion in Progress.1 : Conversion on going0 : conversion completed**Note: This bit will only be reset by PORz." range="16" rwaccess="R"/>
	<bitfield id="TSENSE3_RESULT_DTEMP" width="8" begin="7" end="0" resetval="0x0" description="Temp Code readout**Note: This bit will only be reset by PORz." range="7:0" rwaccess="R"/>
	</register><register id="TOP_CTRL_HW_SPARE_RW0" acronym="TOP_CTRL_HW_SPARE_RW0" offset="4048" width="32" description="">
		<bitfield id="HW_SPARE_RW0_HW_SPARE_RW0" width="32" begin="31" end="0" resetval="0x0" description="Reserved for HW R&#38;D" range="31:0" rwaccess="R/W"/>
	</register><register id="TOP_CTRL_HW_SPARE_RW1" acronym="TOP_CTRL_HW_SPARE_RW1" offset="4052" width="32" description="">
		<bitfield id="HW_SPARE_RW1_HW_SPARE_RW1" width="32" begin="31" end="0" resetval="0x0" description="Reserved for HW R&#38;D" range="31:0" rwaccess="R/W"/>
	</register><register id="TOP_CTRL_HW_SPARE_RW2" acronym="TOP_CTRL_HW_SPARE_RW2" offset="4056" width="32" description="">
		<bitfield id="HW_SPARE_RW2_HW_SPARE_RW2" width="32" begin="31" end="0" resetval="0x0" description="Reserved for HW R&#38;D" range="31:0" rwaccess="R/W"/>
	</register><register id="TOP_CTRL_HW_SPARE_RW3" acronym="TOP_CTRL_HW_SPARE_RW3" offset="4060" width="32" description="">
		<bitfield id="HW_SPARE_RW3_HW_SPARE_RW3" width="32" begin="31" end="0" resetval="0x0" description="Reserved for HW R&#38;D" range="31:0" rwaccess="R/W"/>
	</register><register id="TOP_CTRL_HW_SPARE_RO0" acronym="TOP_CTRL_HW_SPARE_RO0" offset="4064" width="32" description="">
		<bitfield id="HW_SPARE_RO0_HW_SPARE_RO0" width="32" begin="31" end="0" resetval="0x0" description="Reserved for HW R&#38;D" range="31:0" rwaccess="R"/>
	</register><register id="TOP_CTRL_HW_SPARE_RO1" acronym="TOP_CTRL_HW_SPARE_RO1" offset="4068" width="32" description="">
		<bitfield id="HW_SPARE_RO1_HW_SPARE_RO1" width="32" begin="31" end="0" resetval="0x0" description="Reserved for HW R&#38;D" range="31:0" rwaccess="R"/>
	</register><register id="TOP_CTRL_HW_SPARE_RO2" acronym="TOP_CTRL_HW_SPARE_RO2" offset="4072" width="32" description="">
		<bitfield id="HW_SPARE_RO2_HW_SPARE_RO2" width="32" begin="31" end="0" resetval="0x0" description="Reserved for HW R&#38;D" range="31:0" rwaccess="R"/>
	</register><register id="TOP_CTRL_HW_SPARE_RO3" acronym="TOP_CTRL_HW_SPARE_RO3" offset="4076" width="32" description="">
		<bitfield id="HW_SPARE_RO3_HW_SPARE_RO3" width="32" begin="31" end="0" resetval="0x0" description="Reserved for HW R&#38;D" range="31:0" rwaccess="R"/>
	</register><register id="TOP_CTRL_HW_SPARE_WPH" acronym="TOP_CTRL_HW_SPARE_WPH" offset="4080" width="32" description="">
		<bitfield id="HW_SPARE_WPH_HW_SPARE_WPH" width="32" begin="31" end="0" resetval="0x0" description="Reserved for HW R&#38;D" range="31:0" rwaccess="R/W"/>
	</register><register id="TOP_CTRL_HW_SPARE_REC" acronym="TOP_CTRL_HW_SPARE_REC" offset="4084" width="32" description="">
		<bitfield id="HW_SPARE_REC_HW_SPARE_REC31" width="1" begin="31" end="31" resetval="0x0" description="Reserved for HW R&#38;D" range="31" rwaccess="R/W"/>
	<bitfield id="HW_SPARE_REC_HW_SPARE_REC30" width="1" begin="30" end="30" resetval="0x0" description="Reserved for HW R&#38;D" range="30" rwaccess="R/W"/>
	<bitfield id="HW_SPARE_REC_HW_SPARE_REC29" width="1" begin="29" end="29" resetval="0x0" description="Reserved for HW R&#38;D" range="29" rwaccess="R/W"/>
	<bitfield id="HW_SPARE_REC_HW_SPARE_REC28" width="1" begin="28" end="28" resetval="0x0" description="Reserved for HW R&#38;D" range="28" rwaccess="R/W"/>
	<bitfield id="HW_SPARE_REC_HW_SPARE_REC27" width="1" begin="27" end="27" resetval="0x0" description="Reserved for HW R&#38;D" range="27" rwaccess="R/W"/>
	<bitfield id="HW_SPARE_REC_HW_SPARE_REC26" width="1" begin="26" end="26" resetval="0x0" description="Reserved for HW R&#38;D" range="26" rwaccess="R/W"/>
	<bitfield id="HW_SPARE_REC_HW_SPARE_REC25" width="1" begin="25" end="25" resetval="0x0" description="Reserved for HW R&#38;D" range="25" rwaccess="R/W"/>
	<bitfield id="HW_SPARE_REC_HW_SPARE_REC24" width="1" begin="24" end="24" resetval="0x0" description="Reserved for HW R&#38;D" range="24" rwaccess="R/W"/>
	<bitfield id="HW_SPARE_REC_HW_SPARE_REC23" width="1" begin="23" end="23" resetval="0x0" description="Reserved for HW R&#38;D" range="23" rwaccess="R/W"/>
	<bitfield id="HW_SPARE_REC_HW_SPARE_REC22" width="1" begin="22" end="22" resetval="0x0" description="Reserved for HW R&#38;D" range="22" rwaccess="R/W"/>
	<bitfield id="HW_SPARE_REC_HW_SPARE_REC21" width="1" begin="21" end="21" resetval="0x0" description="Reserved for HW R&#38;D" range="21" rwaccess="R/W"/>
	<bitfield id="HW_SPARE_REC_HW_SPARE_REC20" width="1" begin="20" end="20" resetval="0x0" description="Reserved for HW R&#38;D" range="20" rwaccess="R/W"/>
	<bitfield id="HW_SPARE_REC_HW_SPARE_REC19" width="1" begin="19" end="19" resetval="0x0" description="Reserved for HW R&#38;D" range="19" rwaccess="R/W"/>
	<bitfield id="HW_SPARE_REC_HW_SPARE_REC18" width="1" begin="18" end="18" resetval="0x0" description="Reserved for HW R&#38;D" range="18" rwaccess="R/W"/>
	<bitfield id="HW_SPARE_REC_HW_SPARE_REC17" width="1" begin="17" end="17" resetval="0x0" description="Reserved for HW R&#38;D" range="17" rwaccess="R/W"/>
	<bitfield id="HW_SPARE_REC_HW_SPARE_REC16" width="1" begin="16" end="16" resetval="0x0" description="Reserved for HW R&#38;D" range="16" rwaccess="R/W"/>
	<bitfield id="HW_SPARE_REC_HW_SPARE_REC15" width="1" begin="15" end="15" resetval="0x0" description="Reserved for HW R&#38;D" range="15" rwaccess="R/W"/>
	<bitfield id="HW_SPARE_REC_HW_SPARE_REC14" width="1" begin="14" end="14" resetval="0x0" description="Reserved for HW R&#38;D" range="14" rwaccess="R/W"/>
	<bitfield id="HW_SPARE_REC_HW_SPARE_REC13" width="1" begin="13" end="13" resetval="0x0" description="Reserved for HW R&#38;D" range="13" rwaccess="R/W"/>
	<bitfield id="HW_SPARE_REC_HW_SPARE_REC12" width="1" begin="12" end="12" resetval="0x0" description="Reserved for HW R&#38;D" range="12" rwaccess="R/W"/>
	<bitfield id="HW_SPARE_REC_HW_SPARE_REC11" width="1" begin="11" end="11" resetval="0x0" description="Reserved for HW R&#38;D" range="11" rwaccess="R/W"/>
	<bitfield id="HW_SPARE_REC_HW_SPARE_REC10" width="1" begin="10" end="10" resetval="0x0" description="Reserved for HW R&#38;D" range="10" rwaccess="R/W"/>
	<bitfield id="HW_SPARE_REC_HW_SPARE_REC9" width="1" begin="9" end="9" resetval="0x0" description="Reserved for HW R&#38;D" range="9" rwaccess="R/W"/>
	<bitfield id="HW_SPARE_REC_HW_SPARE_REC8" width="1" begin="8" end="8" resetval="0x0" description="Reserved for HW R&#38;D" range="8" rwaccess="R/W"/>
	<bitfield id="HW_SPARE_REC_HW_SPARE_REC7" width="1" begin="7" end="7" resetval="0x0" description="Reserved for HW R&#38;D" range="7" rwaccess="R/W"/>
	<bitfield id="HW_SPARE_REC_HW_SPARE_REC6" width="1" begin="6" end="6" resetval="0x0" description="Reserved for HW R&#38;D" range="6" rwaccess="R/W"/>
	<bitfield id="HW_SPARE_REC_HW_SPARE_REC5" width="1" begin="5" end="5" resetval="0x0" description="Reserved for HW R&#38;D" range="5" rwaccess="R/W"/>
	<bitfield id="HW_SPARE_REC_HW_SPARE_REC4" width="1" begin="4" end="4" resetval="0x0" description="Reserved for HW R&#38;D" range="4" rwaccess="R/W"/>
	<bitfield id="HW_SPARE_REC_HW_SPARE_REC3" width="1" begin="3" end="3" resetval="0x0" description="Reserved for HW R&#38;D" range="3" rwaccess="R/W"/>
	<bitfield id="HW_SPARE_REC_HW_SPARE_REC2" width="1" begin="2" end="2" resetval="0x0" description="Reserved for HW R&#38;D" range="2" rwaccess="R/W"/>
	<bitfield id="HW_SPARE_REC_HW_SPARE_REC1" width="1" begin="1" end="1" resetval="0x0" description="Reserved for HW R&#38;D" range="1" rwaccess="R/W"/>
	<bitfield id="HW_SPARE_REC_HW_SPARE_REC0" width="1" begin="0" end="0" resetval="0x0" description="Reserved for HW R&#38;D" range="0" rwaccess="R/W"/>
	</register><register id="TOP_CTRL_LOCK0_KICK0" acronym="TOP_CTRL_LOCK0_KICK0" offset="4104" width="32" description=" - KICK0 component.">
		<bitfield id="LOCK0_KICK0" width="32" begin="31" end="0" resetval="0x0" description=" - KICK0 component" range="31:0" rwaccess="R/W"/>
	</register><register id="TOP_CTRL_LOCK0_KICK1" acronym="TOP_CTRL_LOCK0_KICK1" offset="4108" width="32" description=" - KICK1 component.">
		<bitfield id="LOCK0_KICK1" width="32" begin="31" end="0" resetval="0x0" description=" - KICK1 component" range="31:0" rwaccess="R/W"/>
	</register><register id="TOP_CTRL_INTR_RAW_STATUS" acronym="TOP_CTRL_INTR_RAW_STATUS" offset="4112" width="32" description="Interrupt Raw Status/Set Register.">
		<bitfield id="PROXY_ERR" width="1" begin="3" end="3" resetval="0x0" description="Proxy0 access violation error. Raw status is read. Write a 1 to set the status. Writing a 0 has no effect." range="3" rwaccess="R/W1TS"/>
	<bitfield id="KICK_ERR" width="1" begin="2" end="2" resetval="0x0" description="Kick access violation error. Raw status is read. Write a 1 to set the status. Writing a 0 has no effect." range="2" rwaccess="R/W1TS"/>
	<bitfield id="ADDR_ERR" width="1" begin="1" end="1" resetval="0x0" description="Addressing violation error. Raw status is read. Write a 1 to set the status. Writing a 0 has no effect." range="1" rwaccess="R/W1TS"/>
	<bitfield id="PROT_ERR" width="1" begin="0" end="0" resetval="0x0" description="Protection violation error. Raw status is read. Write a 1 to set the status. Writing a 0 has no effect." range="0" rwaccess="R/W1TS"/>
